cases/artigo_mestrado/on-caso-1.2/_grid/P3800_d1e19_neohooke/fluid/constant/thermodynamicProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermodynamicProperties;
}

// LCR (CSF) - propriedades termodinamicas (usado por solids4Foam fluid models).
//   rho0 = 1000 kg/m^3 (densidade de referencia)
//   p0   = 0   (pressao de referencia)
//   K    = 1e6 (modulo de bulk; nao usado pelo pimpleFluid mas o framework
//                exige a entrada)

rho0    rho0 [ 1 -3  0 0 0 0 0 ] 1000;
p0      p0   [ 1 -1 -2 0 0 0 0 ] 0;
K       K    [ 1 -1 -2 0 0 0 0 ] 1e6;
