cases/artigo_mestrado/on-caso-1.2/_grid/P3800_d1e19_neohooke/fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

// on-caso-1.2 preCICE adapter (lado FLUIDO).
//   Escreve 'Forces' nas 2 patches FSI (fsi_pia, fsi_dura) -> Solid-Mesh.
//   Le 'Displacements' do solido para mover a malha do fluido (two-way).
//
// IMPORTANTE: nomes de dados PLURAL (Forces, Displacements) para casar com
// a convencao do CalculiX adapter v2.20.1 - difere de on-caso-1 que usava
// singular (Force, Displacement) por convencao do solids4Foam.

preciceConfig "../precice-config.xml";

participant Fluid;

modules ( FSI );

interfaces
{
    Interface1
    {
        mesh              Fluid-Mesh;
        patches           ( fsi_pia fsi_dura );
        locations         faceCenters;

        readData          ( Displacements );
        writeData         ( Forces );
    };
};

FSI
{
    // rho usado pelo adapter para converter p_kinematico * rho * S em Forces
    rho rho [1 -3 0 0 0 0 0] 1000;
}
